Sysbench_PolarDB_Mysql5.7-8.0/Sysbench_Mysql5.7_log/16core128GB-1Node/202103111055/sysbench_read_write_1500.log
Time: 20210311110033, now running sysbench with thread of:  + 1500
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iw90b069kp0j0iim.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=1500 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1500
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1500 tps: 266.17 qps: 28814.15 (r/w/o: 23794.30/3046.12/1973.73) lat (ms,95%): 1013.60 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1500 tps: 1701.65 qps: 34377.13 (r/w/o: 23901.13/7072.70/3403.30) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1500 tps: 1193.17 qps: 23705.42 (r/w/o: 16700.41/4620.67/2384.34) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1500 tps: 1163.85 qps: 23205.02 (r/w/o: 16100.93/4776.39/2327.70) lat (ms,95%): 2728.81 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1500 tps: 1893.25 qps: 37844.05 (r/w/o: 26535.54/7520.00/3788.51) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1500 tps: 981.89 qps: 19790.69 (r/w/o: 13876.38/3950.54/1963.77) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1500 tps: 895.00 qps: 17920.00 (r/w/o: 12559.00/3571.00/1790.00) lat (ms,95%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1500 tps: 944.97 qps: 18965.42 (r/w/o: 13262.59/3812.88/1889.94) lat (ms,95%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1500 tps: 938.12 qps: 18504.35 (r/w/o: 12922.64/3706.47/1875.24) lat (ms,95%): 5124.81 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1500 tps: 992.90 qps: 20109.89 (r/w/o: 14101.52/4021.58/1986.79) lat (ms,95%): 5709.50 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 1500 tps: 942.01 qps: 18706.28 (r/w/o: 13108.19/3714.05/1884.03) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 1500 tps: 1026.00 qps: 20553.10 (r/w/o: 14412.07/4089.02/2052.01) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 1500 tps: 837.13 qps: 16721.56 (r/w/o: 11664.78/3382.52/1674.26) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 1500 tps: 879.95 qps: 17726.05 (r/w/o: 12411.34/3554.81/1759.91) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1500 tps: 1025.95 qps: 20380.98 (r/w/o: 14335.28/3993.80/2051.90) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 1500 tps: 1240.87 qps: 24934.36 (r/w/o: 17415.15/5037.47/2481.74) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 1500 tps: 868.12 qps: 17314.45 (r/w/o: 12077.71/3500.49/1736.25) lat (ms,95%): 5918.87 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 1500 tps: 1064.92 qps: 21180.48 (r/w/o: 14817.94/4232.70/2129.85) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 1500 tps: 1159.05 qps: 23326.92 (r/w/o: 16320.64/4689.18/2317.09) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1500 tps: 977.09 qps: 19374.83 (r/w/o: 13555.28/3865.36/1954.18) lat (ms,95%): 6026.41 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 1500 tps: 1103.87 qps: 22222.48 (r/w/o: 15611.23/4402.50/2208.75) lat (ms,95%): 5507.54 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 1500 tps: 1004.02 qps: 19965.36 (r/w/o: 13923.25/4034.07/2008.04) lat (ms,95%): 6026.41 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 1500 tps: 1043.95 qps: 20898.90 (r/w/o: 14709.23/4101.78/2087.89) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 1500 tps: 779.03 qps: 15638.52 (r/w/o: 10971.37/3109.10/1558.05) lat (ms,95%): 5918.87 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1500 tps: 852.05 qps: 16905.95 (r/w/o: 11773.66/3434.19/1698.10) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 1500 tps: 815.98 qps: 16502.57 (r/w/o: 11575.70/3288.92/1637.96) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 1500 tps: 838.02 qps: 16694.44 (r/w/o: 11751.31/3267.09/1676.04) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 1500 tps: 805.99 qps: 16019.79 (r/w/o: 11245.85/3161.96/1611.98) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 1500 tps: 1090.97 qps: 21778.31 (r/w/o: 15257.52/4338.86/2181.93) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1500 tps: 920.03 qps: 18500.63 (r/w/o: 12863.44/3797.13/1840.06) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 1500 tps: 950.89 qps: 19073.86 (r/w/o: 13384.50/3787.58/1901.79) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 1500 tps: 984.16 qps: 19624.12 (r/w/o: 13739.19/3916.62/1968.31) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 1500 tps: 900.97 qps: 18077.42 (r/w/o: 12618.59/3657.88/1800.94) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 1500 tps: 920.05 qps: 18415.09 (r/w/o: 12864.76/3709.22/1841.11) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1500 tps: 772.88 qps: 15569.53 (r/w/o: 10838.28/3185.50/1545.76) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 1500 tps: 949.04 qps: 19000.79 (r/w/o: 13289.55/3813.16/1898.08) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 1500 tps: 910.98 qps: 18163.53 (r/w/o: 12748.67/3592.91/1821.95) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 1500 tps: 1156.02 qps: 22913.49 (r/w/o: 16022.34/4579.10/2312.05) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 1500 tps: 824.05 qps: 16738.05 (r/w/o: 11689.73/3400.21/1648.10) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1500 tps: 1089.95 qps: 21658.96 (r/w/o: 15181.27/4297.79/2179.89) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 1500 tps: 1053.95 qps: 21215.06 (r/w/o: 14870.34/4236.81/2107.91) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 1500 tps: 1013.98 qps: 20194.58 (r/w/o: 14141.71/4024.92/2027.96) lat (ms,95%): 5918.87 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 1500 tps: 995.10 qps: 19715.99 (r/w/o: 13753.39/3975.40/1987.20) lat (ms,95%): 5607.61 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 1500 tps: 821.05 qps: 16650.95 (r/w/o: 11701.67/3304.19/1645.09) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1500 tps: 823.93 qps: 16477.57 (r/w/o: 11548.00/3281.72/1647.86) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 1500 tps: 1001.97 qps: 20007.37 (r/w/o: 14007.56/3995.87/2003.94) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 1500 tps: 1072.11 qps: 21351.25 (r/w/o: 14939.58/4267.45/2144.23) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 1500 tps: 878.94 qps: 17664.80 (r/w/o: 12368.16/3539.76/1756.88) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 1500 tps: 934.03 qps: 18632.52 (r/w/o: 13050.36/3713.10/1869.05) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1500 tps: 854.06 qps: 17018.29 (r/w/o: 11905.90/3404.26/1708.13) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 1500 tps: 881.88 qps: 17769.58 (r/w/o: 12461.30/3544.52/1763.76) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 1500 tps: 901.98 qps: 17962.69 (r/w/o: 12607.78/3550.94/1803.97) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 1500 tps: 921.03 qps: 18374.51 (r/w/o: 12833.36/3699.10/1842.05) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 1500 tps: 1018.01 qps: 20406.20 (r/w/o: 14264.14/4109.04/2033.02) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1500 tps: 912.03 qps: 18103.50 (r/w/o: 12705.35/3571.10/1827.05) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 1500 tps: 863.05 qps: 17257.00 (r/w/o: 12016.69/3514.20/1726.10) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 1500 tps: 810.01 qps: 16398.12 (r/w/o: 11530.08/3248.02/1620.01) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 1500 tps: 932.95 qps: 18598.99 (r/w/o: 12920.30/3813.79/1864.90) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 1500 tps: 974.03 qps: 19602.60 (r/w/o: 13790.42/3863.12/1949.06) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1500 tps: 919.98 qps: 18370.59 (r/w/o: 12848.72/3682.92/1838.96) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 1500 tps: 926.98 qps: 18575.50 (r/w/o: 12943.65/3776.90/1854.95) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 1500 tps: 1016.05 qps: 20166.97 (r/w/o: 14173.68/3961.19/2032.10) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 1500 tps: 780.00 qps: 15570.02 (r/w/o: 10934.02/3077.00/1559.00) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 1500 tps: 902.91 qps: 18105.21 (r/w/o: 12719.74/3578.65/1806.82) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 1500 tps: 921.10 qps: 18445.92 (r/w/o: 12917.34/3686.38/1842.19) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 1500 tps: 863.03 qps: 17198.58 (r/w/o: 12054.41/3418.12/1726.06) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 1500 tps: 862.96 qps: 17238.20 (r/w/o: 12087.44/3424.84/1725.92) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 1500 tps: 802.97 qps: 16140.40 (r/w/o: 11238.58/3297.88/1603.94) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 1500 tps: 887.05 qps: 17746.06 (r/w/o: 12413.74/3556.21/1776.11) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 1500 tps: 884.01 qps: 17715.21 (r/w/o: 12323.15/3624.04/1768.02) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 1500 tps: 906.99 qps: 18090.83 (r/w/o: 12651.88/3625.97/1812.98) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 1500 tps: 930.02 qps: 18481.30 (r/w/o: 12947.21/3673.06/1861.03) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 1500 tps: 997.96 qps: 20097.17 (r/w/o: 14157.42/3943.84/1995.92) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 1500 tps: 941.98 qps: 18931.62 (r/w/o: 13194.73/3852.92/1883.96) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 1500 tps: 1012.97 qps: 20265.39 (r/w/o: 14192.58/4046.88/2025.94) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 1500 tps: 895.06 qps: 17730.24 (r/w/o: 12505.88/3435.24/1789.13) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 1500 tps: 934.98 qps: 18819.64 (r/w/o: 13083.75/3864.93/1870.96) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 1500 tps: 1156.04 qps: 23042.77 (r/w/o: 16200.54/4530.15/2312.08) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 1500 tps: 886.99 qps: 17762.76 (r/w/o: 12430.83/3557.95/1773.98) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 1500 tps: 900.96 qps: 18042.13 (r/w/o: 12580.39/3659.82/1801.91) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 1500 tps: 950.03 qps: 19070.57 (r/w/o: 13326.40/3844.12/1900.06) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 1500 tps: 1007.96 qps: 20203.28 (r/w/o: 14118.50/4068.86/2015.93) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 1500 tps: 773.03 qps: 15363.61 (r/w/o: 10804.43/3013.12/1546.06) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 1500 tps: 1094.96 qps: 21923.10 (r/w/o: 15323.37/4409.82/2189.91) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 1500 tps: 1111.99 qps: 22194.86 (r/w/o: 15558.90/4411.97/2223.99) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 1500 tps: 901.09 qps: 18004.70 (r/w/o: 12575.19/3627.34/1802.17) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 1500 tps: 1017.94 qps: 20514.72 (r/w/o: 14314.11/4164.74/2035.87) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 1500 tps: 1115.01 qps: 22117.16 (r/w/o: 15455.11/4432.03/2230.02) lat (ms,95%): 6026.41 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 1500 tps: 903.04 qps: 18191.71 (r/w/o: 12776.50/3609.14/1806.07) lat (ms,95%): 5918.87 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 1500 tps: 995.90 qps: 19944.92 (r/w/o: 13971.54/3981.58/1991.79) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 1500 tps: 885.05 qps: 17648.94 (r/w/o: 12394.66/3484.18/1770.09) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 1500 tps: 873.06 qps: 17412.16 (r/w/o: 12187.81/3479.23/1745.12) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 1500 tps: 712.98 qps: 14228.55 (r/w/o: 9945.69/2856.91/1425.96) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 1500 tps: 847.06 qps: 16895.11 (r/w/o: 11821.78/3378.22/1695.11) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 1500 tps: 844.89 qps: 17042.86 (r/w/o: 11933.50/3419.57/1689.79) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 1500 tps: 1071.03 qps: 21393.70 (r/w/o: 14945.49/4306.14/2142.07) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 1500 tps: 1106.01 qps: 22194.10 (r/w/o: 15536.07/4446.02/2212.01) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 1500 tps: 1125.03 qps: 22320.67 (r/w/o: 15709.47/4361.13/2250.07) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 1500 tps: 867.97 qps: 17317.31 (r/w/o: 12136.52/3444.86/1735.93) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 1500 tps: 984.02 qps: 19766.48 (r/w/o: 13769.34/4029.10/1968.05) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 1500 tps: 790.02 qps: 15918.35 (r/w/o: 11123.25/3215.07/1580.04) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 1500 tps: 862.95 qps: 17174.92 (r/w/o: 11998.24/3452.78/1723.89) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 1500 tps: 1079.09 qps: 21527.75 (r/w/o: 15154.23/4214.34/2159.18) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 1500 tps: 983.95 qps: 19725.09 (r/w/o: 13750.36/4005.81/1968.91) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 1500 tps: 771.89 qps: 15405.88 (r/w/o: 10868.50/2993.59/1543.79) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 1500 tps: 1063.22 qps: 21312.34 (r/w/o: 14881.03/4304.88/2126.43) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 1500 tps: 1050.96 qps: 20924.27 (r/w/o: 14637.49/4185.85/2100.93) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 1500 tps: 955.97 qps: 19154.46 (r/w/o: 13461.62/3779.89/1912.95) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 1500 tps: 799.96 qps: 15903.11 (r/w/o: 11170.37/3132.82/1599.91) lat (ms,95%): 6135.91 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 1500 tps: 748.02 qps: 15022.33 (r/w/o: 10498.23/3028.07/1496.03) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 1500 tps: 874.04 qps: 17443.72 (r/w/o: 12106.50/3589.15/1748.07) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 1500 tps: 856.99 qps: 17301.85 (r/w/o: 12123.90/3463.97/1713.99) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 1500 tps: 990.95 qps: 19709.91 (r/w/o: 13825.24/3902.78/1981.89) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 1500 tps: 993.02 qps: 19879.45 (r/w/o: 13939.32/3954.09/1986.05) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 1500 tps: 940.00 qps: 18750.98 (r/w/o: 13131.99/3739.00/1880.00) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 1500 tps: 1096.04 qps: 21892.75 (r/w/o: 15327.52/4373.15/2192.07) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 1500 tps: 891.96 qps: 17921.23 (r/w/o: 12544.46/3592.85/1783.92) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 1500 tps: 751.99 qps: 15057.82 (r/w/o: 10480.87/3072.96/1503.98) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 1500 tps: 901.01 qps: 17949.28 (r/w/o: 12622.19/3525.05/1802.03) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 1500 tps: 890.90 qps: 17706.07 (r/w/o: 12337.65/3599.61/1768.81) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 1500 tps: 573.85 qps: 2145.45 (r/w/o: 0.00/1569.59/575.85) lat (ms,95%): 8638.96 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 1500 tps: 857.74 qps: 2926.71 (r/w/o: 0.00/2066.97/859.74) lat (ms,95%): 8955.74 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 1500 tps: 15.03 qps: 51.09 (r/w/o: 0.00/37.07/14.02) lat (ms,95%): 8184.67 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 1500 tps: 21.00 qps: 58.00 (r/w/o: 0.00/40.00/18.00) lat (ms,95%): 9624.59 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1619492
        write:                           462712
        other:                           231356
        total:                           2313560
    transactions:                        115678 (930.27 per sec.)
    queries:                             2313560 (18605.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          124.3464s
    total number of events:              115678

Latency (ms):
         min:                                    9.51
         avg:                                 1570.94
         max:                                27298.03
         95th percentile:                     6594.16
         sum:                            181722834.04

Threads fairness:
    events (avg/stddev):           77.1187/13.00
    execution time (avg/stddev):   121.1486/0.67